In [1]:
import pandas as pd

In [2]:
# df = pd.read_csv('nyc_weather.csv')
# df.head()

In [3]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'event': ['Rain','Sunny','Snow','Snow','Rain','Sunny'],
    'temperature': [32,35,38,32,30,31],
    'windspeed': [6,7,2,7,4,2]
}

df = pd.DataFrame(weather_data)
df

        day  event  temperature  windspeed
0  1/1/2017   Rain           32          6
1  1/2/2017  Sunny           35          7
2  1/3/2017   Snow           38          2
3  1/4/2017   Snow           32          7
4  1/5/2017   Rain           30          4
5  1/6/2017  Sunny           31          2

In [4]:
df.shape

(6, 4)

In [5]:
rows, columns = df.shape

In [6]:
rows

6

In [7]:
columns

4

In [8]:
df.head()

        day  event  temperature  windspeed
0  1/1/2017   Rain           32          6
1  1/2/2017  Sunny           35          7
2  1/3/2017   Snow           38          2
3  1/4/2017   Snow           32          7
4  1/5/2017   Rain           30          4

In [9]:
df.head(2)

        day  event  temperature  windspeed
0  1/1/2017   Rain           32          6
1  1/2/2017  Sunny           35          7

In [10]:
df.tail()

        day  event  temperature  windspeed
1  1/2/2017  Sunny           35          7
2  1/3/2017   Snow           38          2
3  1/4/2017   Snow           32          7
4  1/5/2017   Rain           30          4
5  1/6/2017  Sunny           31          2

In [11]:
df.tail(2)

        day  event  temperature  windspeed
4  1/5/2017   Rain           30          4
5  1/6/2017  Sunny           31          2

In [12]:
#To print rows 2,3,4
df[2:5]

        day event  temperature  windspeed
2  1/3/2017  Snow           38          2
3  1/4/2017  Snow           32          7
4  1/5/2017  Rain           30          4

In [13]:
#to know the columns name
df.columns

Index(['day', 'event', 'temperature', 'windspeed'], dtype='object')

In [14]:
#Prints column content
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [15]:
#one more way to access the content of the column
df['event']

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [16]:
# prints the type of the data (column)
type(df['event'])

pandas.core.series.Series

In [17]:
# to print more than one selected columns
df[['day','event']]

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [18]:
# to print more than one selected columns
df[['day','event','temperature']]

        day  event  temperature
0  1/1/2017   Rain           32
1  1/2/2017  Sunny           35
2  1/3/2017   Snow           38
3  1/4/2017   Snow           32
4  1/5/2017   Rain           30
5  1/6/2017  Sunny           31

In [19]:
df['temperature'].max()

38

In [20]:
df['temperature'].min()

30

In [21]:
df['temperature'].mean()

33.0

In [22]:
df['temperature'].std()

2.9664793948382653

In [23]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     33.000000   4.666667
std       2.966479   2.338090
min      30.000000   2.000000
25%      31.250000   2.500000
50%      32.000000   5.000000
75%      34.250000   6.750000
max      38.000000   7.000000

In [24]:
#Conditionally print the data i.e, Prints the row which is having the temperature greater than or equal to32
df[df['temperature']>=32]

        day  event  temperature  windspeed
0  1/1/2017   Rain           32          6
1  1/2/2017  Sunny           35          7
2  1/3/2017   Snow           38          2
3  1/4/2017   Snow           32          7

In [25]:
#prints a row which is maximum
df[df['temperature']==df.temperature.max()]

        day event  temperature  windspeed
2  1/3/2017  Snow           38          2

In [26]:
# prints the value(s) from a column where another column has the maximum value
df['day'][df['temperature']==df.temperature.max()]

2    1/3/2017
Name: day, dtype: object

In [27]:
#select the columns to print where one the condition has the maximum value
df[['day','temperature']][df['temperature']==df.temperature.max()]

        day  temperature
2  1/3/2017           38

In [28]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [29]:
df.set_index('day',inplace=True)
df

          event  temperature  windspeed
day
1/1/2017   Rain           32          6
1/2/2017  Sunny           35          7
1/3/2017   Snow           38          2
1/4/2017   Snow           32          7
1/5/2017   Rain           30          4
1/6/2017  Sunny           31          2

In [30]:
df.loc['1/3/2017']

event          Snow
temperature      38
windspeed         2
Name: 1/3/2017, dtype: object

In [31]:
df.reset_index(inplace=True)
df

        day  event  temperature  windspeed
0  1/1/2017   Rain           32          6
1  1/2/2017  Sunny           35          7
2  1/3/2017   Snow           38          2
3  1/4/2017   Snow           32          7
4  1/5/2017   Rain           30          4
5  1/6/2017  Sunny           31          2

In [32]:
df.set_index('event',inplace=True)
df

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           38          2
Snow   1/4/2017           32          7
Rain   1/5/2017           30          4
Sunny  1/6/2017           31          2

In [33]:
df.loc['Snow']

            day  temperature  windspeed
event
Snow   1/3/2017           38          2
Snow   1/4/2017           32          7